# Plumbing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Plumbing Property
GroupTypeId Class See Also
---
Plumbing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Plumbing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Plumbing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Plumbing {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace